Mathe/HA_03/HA_03_AlMaweri.tex
% Created 2020-12-01 Di 19:51
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper, 11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{braket}
\usepackage[germanb]{babel}
\author{Daniel Geinets (453843), Christopher Neumann (409098), Dennis Schulze (458415)}
\date{\today}
\title{Analysis I und Lineare Algebra für Ingenieurwissenschaften \large  \\ Hausaufgabe 03 - Al-Maweri 13}
\hypersetup{
 pdfauthor={Daniel Geinets (453843), Christopher Neumann (409098), Dennis Schulze (458415)},
 pdftitle={Analysis I und Lineare Algebra für Ingenieurwissenschaften \large  \\ Hausaufgabe 03 - Al-Maweri 13},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.4)}, 
 pdflang={Germanb}}
\begin{document}

\maketitle
\tableofcontents

\setcounter{secnumdepth}{0}
\newcommand{\tuple}[1]{\left(#1\right)}
\renewcommand{\cfrac}[3]{#1 \tuple{\frac{#2}{#3}}}
\newcommand{\R}{\mathbb{R}}
\newcommand{\Z}{\mathbb{Z}}
\newcommand{\Q}{\mathbb{Q}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\C}{\mathbb{C}}

\pagebreak

\section{Aufgabe 1}
\label{sec:orgf4d313c}
\subsection{a)}
\label{sec:orgc498b6c}
\subsubsection{i)}
\label{sec:orge12e258}
$$ z^3 = -27i = 27 e^{-\frac{\pi}{2}i} $$

Es gilt für den Betrag \(r\) und das Argument \(\phi_n\) mit \(n \in \set{0, 1, 2}\)
von \(z\)

\begin{align*}
    r &= \sqrt[3]{27} = 3 \\
    \phi_n &= -\frac{\pi}{2 \cdot 3} + \frac{2n\pi}{3} \\
    &= \frac{-\pi + 4n \pi}{6} = \frac{\pi(4n - 1)}{6}
\end{align*}

Dann gilt

$$ z = 3 e^{\frac{\pi(4n - 1)}{6}i} \text{ mit } n = 0, 1, 2 $$

\subsubsection{ii)}
\label{sec:orgb353d4d}
$$ 2z^4 + 4(\sqrt{12} - 2i)z^2 + 16 - 8\sqrt{12}i = 0 $$

Es gilt für den ersten Koeffizienten mit \(r, \phi \in \R\)

\begin{align*}
    r &= \sqrt{12 + (-2)^2} = 4 \\
    \tan(\phi) &= \frac{-2}{\sqrt{12}} = \frac{-1}{\sqrt{3}} \\
    &= \frac{-1}{\sqrt{3}} \\
    \Leftrightarrow \phi &= \arctan \tuple{\frac{-1}{\sqrt{3}}} = -\frac{\pi}{6}
\end{align*}

damit gilt

$$ \sqrt{12} - 2i = 4 e^{-\frac{\pi}{6}i} $$

analog gilt dann für den zweiten Koeffizienten

$$ 16 - 8\sqrt{12}i = 32 e^{-\frac{\pi}{3}i} $$

dann gilt

\begin{align*}
    2z^4 + 4(\sqrt{12} - 2i)z^2 + 16 - 8\sqrt{12}i &= 0 \\
    \Leftrightarrow 2z^4 + 16 e^{-\frac{\pi}{6}i}z^2 + 32 e^{-\frac{\pi}{3}i} &= 0 \\
    \Leftrightarrow z^4 + 8 e^{-\frac{\pi}{6}i}z^2 + 16 e^{-\frac{\pi}{3}i} &= 0 \\
    \Leftrightarrow (z^2 + 4 e^{-\frac{\pi}{6}i})^2 &= 0 \\
\end{align*}

daraus folgt dann die Gleichung

$$ z^2 = -4 e^{-\frac{\pi}{6}i} = 4 e^{\frac{5\pi}{6}i} $$

für \(z\) gilt dann mit \(s, \phi_k \in \R\)

\begin{align*}
    s &= \sqrt{4} = 2 \\
    \phi_k &= \tuple{\frac{5 \pi}{6} + 2k\pi} \frac{1}{2} \text{ mit } k = 0, 1 \\
    &= \tuple{\frac{5 \pi}{6} + \frac{12k\pi}{6}} \frac{1}{2}
    = \tuple{\frac{\pi (5 + 12k)}{6}} \frac{1}{2} \\
    &= \frac{\pi (5 + 12k)}{12}
\end{align*}

damit gilt

$$ z = 2 e^{\frac{\pi (5 + 12k)}{12}i} \text{ mit } k = 0, 1 $$

\textbf{\uline{NOTE:}} In diesem Fall sind das beides doppelte Nullstellen.

\subsection{b)}
\label{sec:orge0204d3}
Es gilt

\begin{align*}
    i e^{\frac{5\pi}{12}i} &= i e^{\frac{2\pi + 3\pi}{4 \cdot 3}i} \\
    &= i e^{\frac{\pi}{4}i + \frac{\pi}{6}i} \\
    &= i \tuple{\cfrac{\cos}{\pi}{4}\cfrac{\cos}{\pi}{6} + i \cfrac{\cos}{\pi}{4}\cfrac{\sin}{\pi}{6}
    +i \cfrac{\sin}{\pi}{4}\cfrac{\cos}{\pi}{6} - \cfrac{\sin}{\pi}{4}\cfrac{\sin}{\pi}{6}} \\
    &= i \tuple{\frac{\sqrt{3}}{2\sqrt{2}} + \frac{1}{2\sqrt{2}}i +
    \frac{\sqrt{3}}{2\sqrt{2}} - \frac{1}{2\sqrt{2}}} \\
    &= \frac{-1 - \sqrt{3}}{2\sqrt{2}} + \frac{\sqrt{3} - 1}{2\sqrt{2}}i
\end{align*}

\section{Aufgabe 2}
\label{sec:orgcfd6450}
\subsection{a)}
\label{sec:org96c0ce9}
$$ p(i) = (i)^4 - 1 = 1 - 1 = 0 $$

\subsection{b)}
\label{sec:orgb75fe93}
Polynomdivision:

\begin{align*}
    (z^4 - 1) / (z^2 + 1) &= \\
    (-z^2 - 1) / (z^2 + 1) &= z^2 \\
    (0) / (z^2 + 1) &= z^2 - 1 
\end{align*}

demnach gilt

$$ \frac{p(z)}{q(z)} = z^2 - 1 $$

\subsection{c)}
\label{sec:org894e187}
\(p\) lässt sich im Komplexen wie folgt zerlegen

\begin{align*}
    p(z) = z^4 - 1 &= (z^2 + 1)(z^2 - 1) \\
    &= (z^2 + 1)(z + 1)(z - 1) \\
    &= (z + i)(z - i)(z + 1)(z - 1) \\
\end{align*}

\subsection{d)}
\label{sec:org0dff2c6}
\(p\) lässt sich im Reellen wie folgt zerlegen

$$ p(z) = z^4 - 1 = (z^2 + 1)(z + 1)(z - 1) $$

\section{Aufgabe 3}
\label{sec:orgc229687}
\subsection{a)}
\label{sec:orgfe3f041}
Für den Nenner \(p\) gilt

\begin{align*}
    p(x) &= x^2 - 2x + 5 \\
    &= (x - 1)^2 + 4
\end{align*}

\subsection{b)}
\label{sec:orgb44cc2d}
\section{Aufgabe 4}
\label{sec:org54962eb}
\subsection{a)}
\label{sec:org75abdbd}
\subsection{b)}
\label{sec:org303bfd9}
\end{document}
